[Killed] BlockStatement
src2/1-loan.js:1:62
-function calculateLoan(LoanAmount, interestRate, MonthToPay) {
-  if (LoanAmount === "" || LoanAmount < 0 || isNaN(LoanAmount)) {
-    return "Please provide a valid loan amount";
-  } else if (interestRate === "" || interestRate < 0 || isNaN(interestRate)) {
-    return "Please provide a valid interestRate";
-  } else if (MonthToPay === "" || MonthToPay < 0 || isNaN(MonthToPay)) {
-    return "Please provide a valid month";
-  } else {
-    const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
-    let payment = (LoanAmount / MonthToPay + interest).toFixed(2);
-    return payment;
-  }
-}
+function calculateLoan(LoanAmount, interestRate, MonthToPay) {}
 console.log(calculateLoan(1000, 0.1, 12));
 
killedBy: calculateLoan BVA: calculateLoan(1000, 0, 0), Expected: "NaN" returns NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NaN"
Received: undefined

[Killed] ConditionalExpression
src2/1-loan.js:2:28
 function calculateLoan(LoanAmount, interestRate, MonthToPay) {
-  if (LoanAmount === "" || LoanAmount < 0 || isNaN(LoanAmount)) {
+  if (LoanAmount === "" || false || isNaN(LoanAmount)) {
     return "Please provide a valid loan amount";
   } else if (interestRate === "" || interestRate < 0 || isNaN(interestRate)) {
killedBy: calculateLoan DT: calculateLoan(-1, 0.1, 12), Expected: "Please provide a valid loan amount" returns Please provide a valid loan amount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid loan amount"
Received: "-0.08"

[Killed] EqualityOperator
src2/1-loan.js:2:28
 function calculateLoan(LoanAmount, interestRate, MonthToPay) {
-  if (LoanAmount === "" || LoanAmount < 0 || isNaN(LoanAmount)) {
+  if (LoanAmount === "" || LoanAmount <= 0 || isNaN(LoanAmount)) {
     return "Please provide a valid loan amount";
   } else if (interestRate === "" || interestRate < 0 || isNaN(interestRate)) {
killedBy: calculateLoan BVA: calculateLoan(0, 5, 0), Expected: "NaN" returns NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NaN"
Received: "Please provide a valid loan amount"

[Killed] StringLiteral
src2/1-loan.js:3:12
 function calculateLoan(LoanAmount, interestRate, MonthToPay) {
   if (LoanAmount === "" || LoanAmount < 0 || isNaN(LoanAmount)) {
-    return "Please provide a valid loan amount";
+    return "";
   } else if (interestRate === "" || interestRate < 0 || isNaN(interestRate)) {
     return "Please provide a valid interestRate";
killedBy: calculateLoan DT: calculateLoan(-1, 0.1, 12), Expected: "Please provide a valid loan amount" returns Please provide a valid loan amount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid loan amount"
Received: ""

[Killed] LogicalOperator
src2/1-loan.js:4:14
 function calculateLoan(LoanAmount, interestRate, MonthToPay) {
   if (LoanAmount === "" || LoanAmount < 0 || isNaN(LoanAmount)) {
     return "Please provide a valid loan amount";
-  } else if (interestRate === "" || interestRate < 0 || isNaN(interestRate)) {
+  } else if (interestRate === "" && interestRate < 0 || isNaN(interestRate)) {
     return "Please provide a valid interestRate";
   } else if (MonthToPay === "" || MonthToPay < 0 || isNaN(MonthToPay)) {
killedBy: calculateLoan DT: calculateLoan(1000, -1, 12), Expected: "Please provide a valid interestRate" returns Please provide a valid interestRate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid interestRate"
Received: "82.50"

[Killed] ConditionalExpression
src2/1-loan.js:4:14
 function calculateLoan(LoanAmount, interestRate, MonthToPay) {
   if (LoanAmount === "" || LoanAmount < 0 || isNaN(LoanAmount)) {
     return "Please provide a valid loan amount";
-  } else if (interestRate === "" || interestRate < 0 || isNaN(interestRate)) {
+  } else if (true) {
     return "Please provide a valid interestRate";
   } else if (MonthToPay === "" || MonthToPay < 0 || isNaN(MonthToPay)) {
killedBy: calculateLoan BVA: calculateLoan(1000, 0, 0), Expected: "NaN" returns NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NaN"
Received: "Please provide a valid interestRate"

[Killed] LogicalOperator
src2/1-loan.js:6:14
     return "Please provide a valid loan amount";
   } else if (interestRate === "" || interestRate < 0 || isNaN(interestRate)) {
     return "Please provide a valid interestRate";
-  } else if (MonthToPay === "" || MonthToPay < 0 || isNaN(MonthToPay)) {
+  } else if (MonthToPay === "" && MonthToPay < 0 || isNaN(MonthToPay)) {
     return "Please provide a valid month";
   } else {
killedBy: calculateLoan DT: calculateLoan(1000, 0.1, -1), Expected: "Please provide a valid month" returns Please provide a valid month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid month"
Received: "-1001.00"

[Killed] EqualityOperator
src2/1-loan.js:6:35
     return "Please provide a valid loan amount";
   } else if (interestRate === "" || interestRate < 0 || isNaN(interestRate)) {
     return "Please provide a valid interestRate";
-  } else if (MonthToPay === "" || MonthToPay < 0 || isNaN(MonthToPay)) {
+  } else if (MonthToPay === "" || MonthToPay >= 0 || isNaN(MonthToPay)) {
     return "Please provide a valid month";
   } else {
killedBy: calculateLoan BVA: calculateLoan(1000, 0, 0), Expected: "NaN" returns NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NaN"
Received: "Please provide a valid month"

[Killed] StringLiteral
src2/1-loan.js:7:12
   } else if (interestRate === "" || interestRate < 0 || isNaN(interestRate)) {
     return "Please provide a valid interestRate";
   } else if (MonthToPay === "" || MonthToPay < 0 || isNaN(MonthToPay)) {
-    return "Please provide a valid month";
+    return "";
   } else {
     const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
killedBy: calculateLoan DT: calculateLoan(1000, 0.1, -1), Expected: "Please provide a valid month" returns Please provide a valid month
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid month"
Received: ""

[Killed] BlockStatement
src2/1-loan.js:8:10
     return "Please provide a valid interestRate";
   } else if (MonthToPay === "" || MonthToPay < 0 || isNaN(MonthToPay)) {
     return "Please provide a valid month";
-  } else {
-    const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
-    let payment = (LoanAmount / MonthToPay + interest).toFixed(2);
-    return payment;
-  }
+  } else {}
 }
 console.log(calculateLoan(1000, 0.1, 12));
killedBy: calculateLoan BVA: calculateLoan(1000, 0, 0), Expected: "NaN" returns NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NaN"
Received: undefined

[Killed] ArithmeticOperator
src2/1-loan.js:9:23
   } else if (MonthToPay === "" || MonthToPay < 0 || isNaN(MonthToPay)) {
     return "Please provide a valid month";
   } else {
-    const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
+    const interest = (LoanAmount / (interestRate * 0.01)) / MonthToPay;
     let payment = (LoanAmount / MonthToPay + interest).toFixed(2);
     return payment;
killedBy: calculateLoan BVA: calculateLoan(1000, 0, 0), Expected: "NaN" returns NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NaN"
Received: "Infinity"

[Killed] ArithmeticOperator
src2/1-loan.js:9:37
   } else if (MonthToPay === "" || MonthToPay < 0 || isNaN(MonthToPay)) {
     return "Please provide a valid month";
   } else {
-    const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
+    const interest = (LoanAmount * (interestRate / 0.01)) / MonthToPay;
     let payment = (LoanAmount / MonthToPay + interest).toFixed(2);
     return payment;
killedBy: calculateLoan BVA: calculateLoan(1000, 10, 24), Expected: "45.83" returns 45.83
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "45.83"
Received: "41708.33"

[Killed] ArithmeticOperator
src2/1-loan.js:10:20
     return "Please provide a valid month";
   } else {
     const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
-    let payment = (LoanAmount / MonthToPay + interest).toFixed(2);
+    let payment = (LoanAmount / MonthToPay - interest).toFixed(2);
     return payment;
   }
killedBy: calculateLoan BVA: calculateLoan(1000, 10, 0), Expected: "Infinity" returns Infinity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Infinity"
Received: "NaN"

[Killed] ArithmeticOperator
src2/1-loan.js:10:20
     return "Please provide a valid month";
   } else {
     const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
-    let payment = (LoanAmount / MonthToPay + interest).toFixed(2);
+    let payment = (LoanAmount * MonthToPay + interest).toFixed(2);
     return payment;
   }
killedBy: calculateLoan BVA: calculateLoan(1000, 0, 24), Expected: "41.67" returns 41.67
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "41.67"
Received: "24000.00"
