[Killed] BlockStatement
src2/2-converter.js:1:44
-function LengthConverter(measurement, val) {
-  var result1, result2;
-
-  if (measurement == "feets") {
-    result1 = (val * 12).toFixed(2) + " inches";
-    result2 = (val / 5280).toFixed(2) + " miles";
-  } else if (measurement === "inches") {
-    result1 = (val / 12).toFixed(2) + " feets";
-    result2 = (val / 63360).toFixed(2) + " miles";
-  } else if (measurement === "miles") {
-    result1 = (val * 5280).toFixed(2) + " feets";
-    result2 = (val * 63360).toFixed(2) + " inches";
-  } else {
-    return "wrong input";
-  }
-  return [result1, result2];
-}
+function LengthConverter(measurement, val) {}
 
 console.log(LengthConverter("feets", 3));
killedBy: LengthConverter BVA: LengthConverter("feets", 0), Expected: ["0.00 inches", "0.00 miles"] returns ["0.00 inches","0.00 miles"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["0.00 inches", "0.00 miles"]
Received: undefined

[Killed] EqualityOperator
src2/2-converter.js:4:7
 function LengthConverter(measurement, val) {
   var result1, result2;
 
-  if (measurement == "feets") {
+  if (measurement != "feets") {
     result1 = (val * 12).toFixed(2) + " inches";
     result2 = (val / 5280).toFixed(2) + " miles";
killedBy: LengthConverter BVA: LengthConverter("feets", 0), Expected: ["0.00 inches", "0.00 miles"] returns ["0.00 inches","0.00 miles"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["0.00 inches", "0.00 miles"]
Received: "wrong input"

[Killed] BlockStatement
src2/2-converter.js:4:31
 function LengthConverter(measurement, val) {
   var result1, result2;
 
-  if (measurement == "feets") {
-    result1 = (val * 12).toFixed(2) + " inches";
-    result2 = (val / 5280).toFixed(2) + " miles";
-  } else if (measurement === "inches") {
+  if (measurement == "feets") {} else if (measurement === "inches") {
     result1 = (val / 12).toFixed(2) + " feets";
     result2 = (val / 63360).toFixed(2) + " miles";
killedBy: LengthConverter BVA: LengthConverter("feets", 0), Expected: ["0.00 inches", "0.00 miles"] returns ["0.00 inches","0.00 miles"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "0.00 inches",
-   "0.00 miles",

[Killed] ArithmeticOperator
src2/2-converter.js:5:16
   var result1, result2;
 
   if (measurement == "feets") {
-    result1 = (val * 12).toFixed(2) + " inches";
+    result1 = (val / 12).toFixed(2) + " inches";
     result2 = (val / 5280).toFixed(2) + " miles";
   } else if (measurement === "inches") {
killedBy: LengthConverter BVA: LengthConverter("feets", 5280), Expected: ["63360.00 inches", "1.00 miles"] returns ["63360.00 inches","1.00 miles"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "63360.00 inches",
+   "440.00 inches",

[Killed] ArithmeticOperator
src2/2-converter.js:6:16
 
   if (measurement == "feets") {
     result1 = (val * 12).toFixed(2) + " inches";
-    result2 = (val / 5280).toFixed(2) + " miles";
+    result2 = (val * 5280).toFixed(2) + " miles";
   } else if (measurement === "inches") {
     result1 = (val / 12).toFixed(2) + " feets";
killedBy: LengthConverter BVA: LengthConverter("feets", 5280), Expected: ["63360.00 inches", "1.00 miles"] returns ["63360.00 inches","1.00 miles"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "63360.00 inches",
-   "1.00 miles",

[Killed] ConditionalExpression
src2/2-converter.js:7:14
   if (measurement == "feets") {
     result1 = (val * 12).toFixed(2) + " inches";
     result2 = (val / 5280).toFixed(2) + " miles";
-  } else if (measurement === "inches") {
+  } else if (false) {
     result1 = (val / 12).toFixed(2) + " feets";
     result2 = (val / 63360).toFixed(2) + " miles";
killedBy: LengthConverter BVA: LengthConverter("inches", 0), Expected: ["0.00 feets", "0.00 miles"] returns ["0.00 feets","0.00 miles"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["0.00 feets", "0.00 miles"]
Received: "wrong input"

[Killed] ConditionalExpression
src2/2-converter.js:7:14
   if (measurement == "feets") {
     result1 = (val * 12).toFixed(2) + " inches";
     result2 = (val / 5280).toFixed(2) + " miles";
-  } else if (measurement === "inches") {
+  } else if (true) {
     result1 = (val / 12).toFixed(2) + " feets";
     result2 = (val / 63360).toFixed(2) + " miles";
killedBy: LengthConverter BVA: LengthConverter("miles", 0), Expected: ["0.00 feets", "0.00 inches"] returns ["0.00 feets","0.00 inches"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "0.00 feets",
-   "0.00 inches",

[Killed] ArithmeticOperator
src2/2-converter.js:8:16
     result1 = (val * 12).toFixed(2) + " inches";
     result2 = (val / 5280).toFixed(2) + " miles";
   } else if (measurement === "inches") {
-    result1 = (val / 12).toFixed(2) + " feets";
+    result1 = (val * 12).toFixed(2) + " feets";
     result2 = (val / 63360).toFixed(2) + " miles";
   } else if (measurement === "miles") {
killedBy: LengthConverter BVA: LengthConverter("inches", 63360), Expected: ["5280.00 feets", "1.00 miles"] returns ["5280.00 feets","1.00 miles"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "5280.00 feets",
+   "760320.00 feets",

[Killed] ArithmeticOperator
src2/2-converter.js:9:16
     result2 = (val / 5280).toFixed(2) + " miles";
   } else if (measurement === "inches") {
     result1 = (val / 12).toFixed(2) + " feets";
-    result2 = (val / 63360).toFixed(2) + " miles";
+    result2 = (val * 63360).toFixed(2) + " miles";
   } else if (measurement === "miles") {
     result1 = (val * 5280).toFixed(2) + " feets";
killedBy: LengthConverter BVA: LengthConverter("inches", 63360), Expected: ["5280.00 feets", "1.00 miles"] returns ["5280.00 feets","1.00 miles"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "5280.00 feets",
-   "1.00 miles",

[Killed] BlockStatement
src2/2-converter.js:10:39
   } else if (measurement === "inches") {
     result1 = (val / 12).toFixed(2) + " feets";
     result2 = (val / 63360).toFixed(2) + " miles";
-  } else if (measurement === "miles") {
-    result1 = (val * 5280).toFixed(2) + " feets";
-    result2 = (val * 63360).toFixed(2) + " inches";
-  } else {
+  } else if (measurement === "miles") {} else {
     return "wrong input";
   }
killedBy: LengthConverter BVA: LengthConverter("miles", 0), Expected: ["0.00 feets", "0.00 inches"] returns ["0.00 feets","0.00 inches"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "0.00 feets",
-   "0.00 inches",

[Killed] ConditionalExpression
src2/2-converter.js:10:14
   } else if (measurement === "inches") {
     result1 = (val / 12).toFixed(2) + " feets";
     result2 = (val / 63360).toFixed(2) + " miles";
-  } else if (measurement === "miles") {
+  } else if (true) {
     result1 = (val * 5280).toFixed(2) + " feets";
     result2 = (val * 63360).toFixed(2) + " inches";
killedBy: LengthConverter DT: LengthConverter("kilometers", 5), Expected: "wrong input" returns "wrong input"
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "wrong input"
Received: ["26400.00 feets", "316800.00 inches"]

[Killed] ArithmeticOperator
src2/2-converter.js:11:16
     result1 = (val / 12).toFixed(2) + " feets";
     result2 = (val / 63360).toFixed(2) + " miles";
   } else if (measurement === "miles") {
-    result1 = (val * 5280).toFixed(2) + " feets";
+    result1 = (val / 5280).toFixed(2) + " feets";
     result2 = (val * 63360).toFixed(2) + " inches";
   } else {
killedBy: LengthConverter BVA: LengthConverter("miles", 1), Expected: ["5280.00 feets", "63360.00 inches"] returns ["5280.00 feets","63360.00 inches"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "5280.00 feets",
+   "0.00 feets",

[Killed] StringLiteral
src2/2-converter.js:11:41
     result1 = (val / 12).toFixed(2) + " feets";
     result2 = (val / 63360).toFixed(2) + " miles";
   } else if (measurement === "miles") {
-    result1 = (val * 5280).toFixed(2) + " feets";
+    result1 = (val * 5280).toFixed(2) + "";
     result2 = (val * 63360).toFixed(2) + " inches";
   } else {
killedBy: LengthConverter BVA: LengthConverter("miles", 0), Expected: ["0.00 feets", "0.00 inches"] returns ["0.00 feets","0.00 inches"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "0.00 feets",
+   "0.00",

[Killed] ArithmeticOperator
src2/2-converter.js:12:16
     result2 = (val / 63360).toFixed(2) + " miles";
   } else if (measurement === "miles") {
     result1 = (val * 5280).toFixed(2) + " feets";
-    result2 = (val * 63360).toFixed(2) + " inches";
+    result2 = (val / 63360).toFixed(2) + " inches";
   } else {
     return "wrong input";
killedBy: LengthConverter BVA: LengthConverter("miles", 1), Expected: ["5280.00 feets", "63360.00 inches"] returns ["5280.00 feets","63360.00 inches"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "5280.00 feets",
-   "63360.00 inches",

[Killed] BlockStatement
src2/2-converter.js:13:10
   } else if (measurement === "miles") {
     result1 = (val * 5280).toFixed(2) + " feets";
     result2 = (val * 63360).toFixed(2) + " inches";
-  } else {
-    return "wrong input";
-  }
+  } else {}
   return [result1, result2];
 }
killedBy: LengthConverter DT: LengthConverter("kilometers", 5), Expected: "wrong input" returns "wrong input"
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "wrong input"
Received: [undefined, undefined]
