[Killed] BlockStatement
src/advanced.js:3:20
 // 210042112
 
-function Pow(x, n) {
-  return x ** n;
-}
+function Pow(x, n) {}
 
 function Modulo(a, b) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/advanced.js:11:20
   return a % b;
 }
 
-function GCD(a, b) {
-  a = Math.abs(a);
-  b = Math.abs(b);
-
-  while (b !== 0) {
-    const remainder = a % b;
-    a = b;
-    b = remainder;
-  }
-
-  return a;
-}
+function GCD(a, b) {}
 
 console.log(Pow(2, 3));
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
src/advanced.js:15:10
   a = Math.abs(a);
   b = Math.abs(b);
 
-  while (b !== 0) {
+  while (false) {
     const remainder = a % b;
     a = b;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 4

[Killed] EqualityOperator
src/advanced.js:15:10
   a = Math.abs(a);
   b = Math.abs(b);
 
-  while (b !== 0) {
+  while (b === 0) {
     const remainder = a % b;
     a = b;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 4

[Timeout] ArithmeticOperator
src/advanced.js:16:23
   b = Math.abs(b);
 
   while (b !== 0) {
-    const remainder = a % b;
+    const remainder = a * b;
     a = b;
     b = remainder;
