[Killed] BlockStatement
src2/3-sorting.js:1:29
-function insertionSort(arr) {
-    let n = arr.length;
-        for (let i = 1; i < n; i++) {
-            let current = arr[i];
-            let j = i-1; 
-            while ((j > -1) && (current < arr[j])) {
-                arr[j+1] = arr[j];
-                j--;
-            }
-            arr[j+1] = current;
-        }
-    return arr;
-}
+function insertionSort(arr) {}
 
 console.log(insertionSort([2,1,4,3]))
killedBy: insertionSort BVA: insertionSort([]), Expected: [] returns []
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src2/3-sorting.js:3:37
 function insertionSort(arr) {
     let n = arr.length;
-        for (let i = 1; i < n; i++) {
-            let current = arr[i];
-            let j = i-1; 
-            while ((j > -1) && (current < arr[j])) {
-                arr[j+1] = arr[j];
-                j--;
-            }
-            arr[j+1] = current;
-        }
+        for (let i = 1; i < n; i++) {}
     return arr;
 }
killedBy: insertionSort BVA: insertionSort([2, 1]), Expected: [1, 2] returns [1,2]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] EqualityOperator
src2/3-sorting.js:3:25
 function insertionSort(arr) {
     let n = arr.length;
-        for (let i = 1; i < n; i++) {
+        for (let i = 1; i <= n; i++) {
             let current = arr[i];
             let j = i-1; 
killedBy: insertionSort BVA: insertionSort([1]), Expected: [1] returns [1]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    1,
+   undefined,

[Killed] LogicalOperator
src2/3-sorting.js:6:20
         for (let i = 1; i < n; i++) {
             let current = arr[i];
             let j = i-1; 
-            while ((j > -1) && (current < arr[j])) {
+            while (j > -1 || current < arr[j]) {
                 arr[j+1] = arr[j];
                 j--;
killedBy: insertionSort DT: insertionSort([2, 1, 4, 3]), Expected: [1, 2, 3, 4] returns [1,2,3,4]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   2,

[Killed] EqualityOperator
src2/3-sorting.js:6:21
         for (let i = 1; i < n; i++) {
             let current = arr[i];
             let j = i-1; 
-            while ((j > -1) && (current < arr[j])) {
+            while ((j <= -1) && (current < arr[j])) {
                 arr[j+1] = arr[j];
                 j--;
killedBy: insertionSort BVA: insertionSort([2, 1]), Expected: [1, 2] returns [1,2]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] ArithmeticOperator
src2/3-sorting.js:7:21
             let current = arr[i];
             let j = i-1; 
             while ((j > -1) && (current < arr[j])) {
-                arr[j+1] = arr[j];
+                arr[j - 1] = arr[j];
                 j--;
             }
killedBy: insertionSort BVA: insertionSort([2, 1]), Expected: [1, 2] returns [1,2]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   2,

[Killed] ObjectLiteral
src2/3-sorting.js:16:18
 }
 
 console.log(insertionSort([2,1,4,3]))
-module.exports = {
-    insertionSort
-}
+module.exports = {}
killedBy: insertionSort BVA: insertionSort([]), Expected: [] returns []
statusReason: TypeError: insertionSort is not a function
